app/controllers/favorites_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 2
---
  def show
    @user = User.find(params[:id])
    @fav = Favorite.where(:user_id => @user)

INSERT INTO "favorites" ("name", "image_url", "url", "rating", "display_address", "display_phone", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @fav = Favorite.new(favorite_params)
      if @fav.valid?
        @fav.save()