app/controllers/users_controller.rb

  def index
    p "in users_controller index"
    #@user = User.all
    render :json => User.all.as_json
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
      if @user.valid?
        @user.save()
---
INSERT INTO "users" ("name", "email", "password_digest", "auth_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)